"""
4、使用字典，编写景区一个景点查询工具，
	要求：
	菜单分为省/市/景点三级菜单
	用户必须先输入省份查看全部地市信息
	用户输入地市可以查看本地的所有景点信息
	案例(不要复制这个字典，写一个你所在省份和邻近省份的)：
	travel_map_dict = {
		    "上海": {"崇明": ["崇明1", "崇明2", "崇明3", "崇明4"],
			   "宝山": ["宝山1", "宝山2", "宝山3", "宝山4"],
			   "奉贤": ["奉贤1", "奉贤2", "奉贤3", "奉贤4"]},

		    "北京": {"昌平": ["昌平1", "昌平2", "昌平3", "昌平4"],
			   "朝阳": ["朝阳1", "朝阳2", "朝阳3", "朝阳4"],
			   "海淀": ["海淀1", "海淀2", "海淀3", "海淀4"]}}
"""
travel_map_dict = {
    "上海": {"崇明": ["崇明1", "崇明2", "崇明3", "崇明4"],
           "宝山": ["宝山1", "宝山2", "宝山3", "宝山4"],
           "奉贤": ["奉贤1", "奉贤2", "奉贤3", "奉贤4"]},

    "北京": {"昌平": ["昌平1", "昌平2", "昌平3", "昌平4"],
           "朝阳": ["朝阳1", "朝阳2", "朝阳3", "朝阳4"],
           "海淀": ["海淀1", "海淀2", "海淀3", "海淀4"]}}

province = input("请输入省份:")

if province in travel_map_dict.keys():
    for i in travel_map_dict[province].keys():
        print(i, end="，")
    city = input("请输入地区:")
    for i in travel_map_dict[province][city]:
        print(i, end="，")

else:
    print("请选择国内的省份")
