"""
常用快捷键：
    ctrl + d 快速复制选中内容
    ctrl + y 删除选中内容
    ctrl + alt + l  快速整理代码（容易和热键起冲突）
"""
print(111)

print(222)

print(333)

print(444)
print(555)

# 数字格式化输出
print("我今年19岁")
print("我今年%d岁" % 19)
print("我今年%i岁" % 29)
print("我今年%u岁" % 39)
print("我今年%f岁" % 39)

# 字符串格式化输出
# print("这是%s个%s人" % "好")
print("这是%s个%s人" % ("一", "好"))

# shift + table 回退一个table--制表符
"""
格式符号         转换
%i			    表示一个int类型的元素
%d             有符号的十进制整数
%s             通过字符串格式化
%c             字符
%u             无符号的十进制整数
%o             八进制整数
%x/X           十六进制整数
%e/E           索引符号
%f             浮点实数
"""
